import { Injectable } from '@angular/core';

  @Injectable({
    providedIn: 'root'
  })
  export class RegionService {
    regions = [
      { id: "1", name: "Акмолинская область" },
      { id: "2", name: "Актюбинская область" },
      { id: "3", name: "Алматинская область" },
      { id: "4", name: "Атырауская область" },
      { id: "5", name: "Восточно-Казахстанская область" },
      { id: "6", name: "Жамбылская область" },
      { id: "7", name: "Западно-Казахстанская область" },
      { id: "8", name: "Казахстан-Каратауская область" },
      { id: "9", name: "Костанайская область" },
      { id: "10", name: "Кызылординская область" },
      { id: "11", name: "Мангистауская область" },
      { id: "12", name: "Павлодарская область" },
      { id: "13", name: "Северо-Казахстанская область" },
      { id: "14", name: "Туркестанская область" },
      { id: "15", name: "Улытауская область" },
      { id: "16", name: "Шымкентская область" },
      { id: "17", name: "Город Нур-Султан" },
      { id: "18", name: "Город Алматы" },
      { id: "19", name: "Город Шымкент" },
    ];

    getCitiesByRegion(regionId: string) {
      // Имитация получения городов
      return [
        { id: "1", name: "Астана" },
        { id: "2", name: "Акколь" },
        { id: "3", name: "Костанай" },
      ];
    }

    getRegions() {
      return this.regions;
    }
  }